from datetime import datetime,timedelta

# Είπαμε στο μάθημα της Παρασκευής 9/6 ότι θα πρέπει να ζητήσετε από τον χρητη την ακριβή ώρα αναχώρησης.
# Στην συνέχεια για την καλύτερη λειτουργία του Google API θα πρέπει να κατασκευάσετε το datetime object που αντιστοιχεί στην συγκεκριμένη ώρα την επόμενη ημέρα το πρωί.
# Έστω ότι ο χρήστης θέλει να ξεκινήσει στις 9 ακριβώς.

h = 9
m = 0

d = datetime.now() # Χρησιμοποιήτε την τρέχουσα ώρα

d = d.replace(hour=h) # Θέτετε την ώρα και τα λεπτά στις επιθυμητές τιμές
d = d.replace(minute=m) 

d = d.replace(second=0) # Θέτετε δευτερόλεπτα και microsecond μηδέν
d = d.replace(microsecond=0)

# Οπότε μέχρι εδώ έχετε την επιθυμητή χρονική στιγμή της τρέχουσας ημέρας
# Και τέλος προσθέτετε μία ολόκληρη ημέρα για να παε στην αντίσοτιχη χροσνική στιγμή αύριο.
d = d+timedelta(days=1)

print(d)